app/Controllers/AdminRegister.php

    public function register()
    {
        $rules = [
            'email' => 'required|min_length[4]|max_length[255]|valid_email|is_unique[admins.email]',
            'password' => 'required|min_length[4]|max_length[15]',
            'confirm_password' => 'matches[password]'
        ];

        if ($this->validate($rules)) {
            $data = [
                'email'    => $this->request->getPost('email'),
                'password' => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
                'role'    => 'Admin',
            ];
            $this->adminModel->insert($data);
---
INSERT INTO `admins` (`email`, `password`, `role`, `created_at`, `updated_at`) VALUES ('sai@gmail.com', '$2y$10$wEOMugVc9Ei2sxHzc5an8.N91fL.lp3E5z7Ay6mse0LiOeJ.Rgzo2', 'Admin', '2025-03-20 09:36:31', '2025-03-20 09:36:31')