app/Controllers/Classes.php

DELETE FROM `classes`
WHERE `class_id` = '1'
---
    public function delete($id = null)
    {
        if ($id === null) {
            return $this->failNotFound('Class ID is required');
        }

        $class = $this->model->where('class_id', $id)->first();

        if (!$class) {
            return $this->failNotFound('Class not found');
        }

        $this->model->where('class_id', $id)->delete();