app/Controllers/Parents.php

DELETE FROM `parents`
WHERE `parent_id` IN ('4')
---
public function delete($id = null)
{
    $parent = $this->model->find($id);

    if (empty($parent)) {
        $response = [
            'status'  => "Error",
            'code'    => 404,
            'message' => 'parent not found',
            'data'    => null,
            'errors'  => null,
        ];
        return $this->respond($response, 404);
    }

    if ($this->model->delete($id)) {